Revit 2027 API
IFrameworkElementCreator Interface
 Interface that the Revit UI will call, if present, to construct the FrameworkElement for the pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IFrameworkElementCreator
Public Interface IFrameworkElementCreator
public interface class IFrameworkElementCreator
type IFrameworkElementCreator = interface end
The IFrameworkElementCreator type exposes the following members.
Methods
Name | Description
CreateFrameworkElement |  Method called to create the FrameworkElement.
Top
Example
//
// Class implementing the interface used in Revit to
// on demand create the pane UI.
//
internal class BrowserCreator : IFrameworkElementCreator
{
   //
   // Implement the creation call back by returning a
   // new WebBrowser each time the callback is triggered.
   //
   public FrameworkElement CreateFrameworkElement()
   {
      return new WebBrowser();
   }
}
See Also
Reference
Autodesk.Revit.UI Namespace